{
  "story": "Your ship, the Horizon Voyager, drifts silently through the void of Sector Delta-9. You and your crew have been tracing a mysterious energy signal for days, one not logged in any galactic database. Suddenly, the signal spikes — an ancient alien beacon pulses from the surface of an uncharted planet covered in clouds of electric storms.",
  "choices": {
    "land on the planet": {
      "story": "You engage the descent thrusters, punching through turbulent clouds and lightning bursts that scrape the ship’s shields. The landscape below glows faintly blue, dotted with metallic ruins half-swallowed by crystalline vegetation. The alien signal hums in your comms, rhythmic like a heartbeat.",
      "choices": {
        "EXPLORE THE MAIN RUIN": {
          "story": "You lead a team of explorers toward a colossal alien temple. Its door is circular, marked with runes that shift and rearrange like living text. The air hums with static energy, and your motion scanner detects movement deep within.",
          "choices": {
            "DECODE THE RUNES": {
              "story": "Your ship’s linguistics AI processes the symbols, slowly revealing their meaning. They are warnings — something was sealed away here to protect the galaxy from its power. The final symbol translates roughly to 'Containment Breach Imminent.'",
              "choices": {
                "OPEN THE DOOR ANYWAY": {
                  "story": "The runes pulse brighter as you press your hand to the console. With a groaning hiss, the door slides open. Inside, a chamber filled with floating crystals surrounds a massive orb radiating blue light. It speaks inside your mind, offering infinite knowledge for a simple exchange — your memories.",
                  "randomSequence": {
                    "initialText": "You drift through the silent corridors of the derelict ship, your helmet light flickering as you float deeper into the darkness...",
                    "minSteps": 2,
                    "maxSteps": 5,
                    "roomOdds": 0.4,
                    "hallwayNames": [
                      "corridor",
                      "maintenance shaft",
                      "airlock tunnel",
                      "deckway",
                      "reactor conduit"
                    ]
                  }
                },
                "SEARCH FOR A SIDE ENTRANCE": {
                  "story": "You circle the temple and find a cracked ventilation shaft. Crawling through, you enter a chamber filled with strange alien machinery. One console still functions, its display showing an energy map of the entire planet. As you are looking around, the door closes behind you with a thud. A faint glow seeps from the edges. The oxygen gauge on your wrist begins to flash red — you need to find power soon.",
                  "choices": {
                    "Try to open the airlock manually": {
                      "randomSequence": {
                        "initialText": "You grip the manual override lever, pulling with all your strength. The door creaks open, revealing another maze of dimly lit passageways...",
                        "minSteps": 2,
                        "maxSteps": 4,
                        "roomOdds": 0.3,
                        "hallwayNames": [
                          "maintenance corridor",
                          "engine deck",
                          "cargo bay tunnel"
                        ]
                      },
                      "story": "You enter what looks like an engineering section. The air is thick with coolant mist and the hum of malfunctioning drones fills the space.",
                      "choices": {
                        "Inspect the drones": {
                          "randomSequence": {
                            "initialText": "You move closer, your scanner flickering as you step among tangled wiring and fallen machinery.",
                            "minSteps": 1,
                            "maxSteps": 2,
                            "roomOdds": 0.2,
                            "hallwayNames": [
                              "maintenance route",
                              "engineering hallway"
                            ]
                          },
                          "story": "One of the drones suddenly powers on. Its optics lock onto you with a menacing red glare.",
                          "choices": {
                            "Fight the drone": {
                              "story": "You blast the drone with your plasma cutter. It collapses in a shower of sparks. A nearby door unlocks — maybe a way out?"
                            },
                            "Run away": {
                              "story": "You sprint down the hall, sparks flying from the walls as laser fire grazes your suit. You duck into a storage bay and catch your breath."
                            }
                          }
                        },
                        "Search for a power terminal": {
                          "randomSequence": {
                            "initialText": "You navigate through the reactor conduits, guided by the flickering lights of emergency panels.",
                            "minSteps": 2,
                            "maxSteps": 7,
                            "roomOdds": 0.8,
                            "hallwayNames": [
                              "reactor conduit",
                              "plasma chamber",
                              "core passage"
                            ]
                          },
                          "story": "You find a still-functioning power terminal. Its screen blinks faintly: SYSTEM OVERRIDE AVAILABLE.",
                          "choices": {
                            "Attempt to override power grid": {
                              "story": "You bypass the security protocols. The ship’s main power hums to life — lights flicker, and gravity stabilizes."
                            },
                            "Leave it alone": {
                              "story": "You decide it’s too risky to tamper with ancient ship systems. You back away, the low hum of power fading into silence."
                            }
                          }
                        }
                      }
                    },
                    "Look for another route": {
                      "randomSequence": {
                        "initialText": "You push off a bulkhead, floating down a narrow ventilation shaft lined with flickering cables.",
                        "minSteps": 4,
                        "maxSteps": 6,
                        "roomOdds": 0.35,
                        "hallwayNames": [
                          "vent tunnel",
                          "access conduit",
                          "observation hallway"
                        ]
                      },
                      "story": "You emerge into a vast observation chamber. The shattered viewports reveal a breathtaking sight — a dying star on the horizon.",
                      "choices": {
                        "Admire the view": {
                          "story": "For a moment, you forget the danger. The cosmic beauty fills you with awe and dread in equal measure."
                        },
                        "Search for an exit": {
                          "randomSequence": {
                            "initialText": "You drift past floating debris, moving toward a faint blinking light on the far wall.",
                            "minSteps": 2,
                            "maxSteps": 4,
                            "roomOdds": 0.25,
                            "hallwayNames": [
                              "escape conduit",
                              "emergency deck",
                              "lifepod access"
                            ]
                          },
                          "story": "You find a functioning escape pod — its systems are ancient but still responsive. Salvation may be within reach."
                        }
                      }
                    }
                  }
                }
              }
            },
            "USE EXPLOSIVES TO OPEN THE DOOR": {
              "story": "You plant a small plasma charge and take cover. The blast echoes through the ruin, scattering dust and glowing shards. As the smoke clears, the door stands open, revealing a corridor lined with ancient stasis pods. One pod hisses, and something begins to move inside."
            }
          }
        },
        "SCAN THE AREA FIRST": {
          "story": "You decide to study the surroundings before entering. The scanners detect faint life signs and a dense energy field beneath the surface. The signal’s source appears split, with one part in the ruins and another deep underground.",
          "choices": {
            "INVESTIGATE THE ENERGY SOURCE": {
              "story": "You trek across the landscape to a canyon filled with glowing spires. At the center is a pulsating fissure emitting waves of pure radiation. Inside the crack, you spot an enormous alien device, still active after eons.",
              "choices": {
                "ACTIVATE THE DEVICE": {
                  "story": "The ground trembles as the machine awakens. A holographic projection fills the sky, showing a star map — thousands of systems connected by shimmering lines. A message echoes: 'The Architects return. Prepare the gateways.'"
                },
                "COLLECT DATA AND RETURN": {
                  "story": "You record the readings and retreat. When you transmit the data to your ship, the comms suddenly distort. A new voice, calm and unfamiliar, speaks from the static: 'You have seen too much. You must not leave.'"
                }
              }
            },
            "SET UP CAMP AND OBSERVE": {
              "story": "You establish a research camp near the ship. As night falls, the twin moons rise and strange lights begin to drift over the horizon. One crew member swears they see figures moving in the distance — tall, luminous beings watching silently. You hear a noise behind you, suddenly the ground explodes beneath you, leaving you unconscous.",
              "choices": {
                "WAKE UP": {
                  "randomSequence": {
                    "initialText": "You find yourself in a strange dark catacomb, surrounded by alien markings",
                    "minSteps": 5,
                    "maxSteps": 10,
                    "roomOdds": 0.25,
                    "hallwayNames": [
                      "Karik counsel",
                      "dimly lit hallway",
                      "life support deck"
                    ]
                  },
                  "story": "You make it to the end, and find your way out, however its too late, the aliens have already taken over the entire base camp. Mission failed"
                }
              }
            }
          }
        }
      }
    },
    "STAY IN ORBIT AND DEPLOY A PROBE": {
      "story": "You decide to play it safe and send down a reconnaissance probe. Its camera feed transmits stunning views of alien ruins, but after a few minutes the video cuts to static. A distorted signal floods the ship’s systems — rhythmic, coded, and hauntingly familiar.",
      "choices": {
        "DECODE THE TRANSMISSION": {
          "story": "Your communications officer works quickly, isolating the signal. It resolves into an image: a vast stone face half-buried in sand, with a single glowing eye. The ship’s lights flicker, and your AI warns, 'External influence detected. Firewall breach in progress.'",
          "choices": {
            "RESPOND TO THE SIGNAL": {
              "story": "You broadcast a greeting in multiple languages. The reply is immediate — a booming voice fills the cockpit: 'We remember your kind. You should not have come back.' The ship begins to drift toward the planet without your control."
            },
            "CUT ALL COMMUNICATIONS": {
              "story": "You sever the connection, but the ship’s navigation system malfunctions. You are pulled into orbit around a massive, artificial moon. Its surface opens like an iris, revealing a docking port shaped exactly to your vessel’s dimensions."
            }
          }
        },
        "FOLLOW THE PROBE’S LAST COORDINATES": {
          "story": "You pilot the Horizon Voyager to the last known position of the probe. Lightning flashes around you, illuminating the colossal remains of an alien starship buried in the clouds. As you approach, your ship’s sensors detect faint power readings coming from within."
        }
      }
    }
  }
}
